results/springboot/r5ad.xlarge/wrk4.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r5ad.xlarge
Spring Boot Host: springboot-server-r5ad-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r5ad-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.27ms  677.11us  27.21ms   80.55%
    Req/Sec    11.08k   516.75    12.39k    75.87%
  Latency Distribution
     50%    2.21ms
     75%    2.50ms
     90%    3.00ms
     99%    4.26ms
  1324940 requests in 1.00m, 177.14MB read
Requests/sec:  22045.57
Transfer/sec:      2.95MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r5ad-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.41ms    1.36ms  36.28ms   78.75%
    Req/Sec    11.41k   499.43    12.46k    76.17%
  Latency Distribution
     50%    4.35ms
     75%    4.92ms
     90%    5.87ms
     99%    8.27ms
  1362497 requests in 1.00m, 182.16MB read
Requests/sec:  22673.27
Transfer/sec:      3.03MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r5ad-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.70ms    2.78ms  76.33ms   80.34%
    Req/Sec    11.60k   514.38    12.74k    77.59%
  Latency Distribution
     50%    8.68ms
     75%    9.74ms
     90%   11.33ms
     99%   16.13ms
  690357 requests in 30.08s, 92.30MB read
Requests/sec:  22947.89
Transfer/sec:      3.07MB

===== Spring Boot Benchmark Complete =====